# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
s1=pd.Series(np.random.randint(0,high=5,size=100,dtype='l'))
s2=pd.Series(np.random.randint(1,high=4,size=100,dtype='l'))
s3=pd.Series(np.random.randint(10000,high=30001,size=100,dtype='l'))
print(s1,s2,s3)

0     4
1     0
2     1
3     2
4     4
     ..
95    4
96    2
97    3
98    0
99    0
Length: 100, dtype: int32 0     1
1     2
2     3
3     3
4     3
     ..
95    2
96    2
97    3
98    2
99    1
Length: 100, dtype: int32 0     28866
1     15939
2     23273
3     22405
4     19919
      ...
95    23347
96    27393
97    28380
98    20707
99    12215
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
dataframe=pd.concat([s1,s2,s3],axis=1)
dataframe.head()

   0  1      2
0  4  1  28866
1  0  2  15939
2  1  3  23273
3  2  3  22405
4  4  3  19919

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [6]:
dataframe.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
dataframe.head()

   bedrs  bathrs  price_sqr_meter
0      4       1            28866
1      0       2            15939
2      1       3            23273
3      2       3            22405
4      4       3            19919

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [ ]:
result=pd.concat([s1,s2,s3],axis=0)
# it is still a Series, so we need to transform it to a DataFrame
result=result.to_frame()
result

        0
0       4
1       0
2       1
3       2
4       4
..    ...
95  23347
96  27393
97  28380
98  20707
99  12215

[300 rows x 1 columns]

In [8]:
print(type(result))

<class 'pandas.core.frame.DataFrame'>

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [ ]:
len(result)         #no

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [ ]:
#dataframe.reindex(range(300))

     bedrs  bathrs  price_sqr_meter
0      4.0     1.0          28866.0
1      0.0     2.0          15939.0
2      1.0     3.0          23273.0
3      2.0     3.0          22405.0
4      4.0     3.0          19919.0
..     ...     ...              ...
295    NaN     NaN              NaN
296    NaN     NaN              NaN
297    NaN     NaN              NaN
298    NaN     NaN              NaN
299    NaN     NaN              NaN

[300 rows x 3 columns]

In [14]:
dataframe.reset_index(drop=True,inplace=True)
dataframe.head()

   bedrs  bathrs  price_sqr_meter
0      4       1            28866
1      0       2            15939
2      1       3            23273
3      2       3            22405
4      4       3            19919